In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
!ls /Users/LING

'ls' is not recognized as an internal or external command,
operable program or batch file.

In [3]:
df = pd.read_csv('/Users/LING/apply_demo.csv')

In [4]:
df.head()

         time                                data
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649

In [5]:
df.size

7978

In [6]:
s1 = Series(['a']*7978)

In [8]:
df['A'] = s1

In [9]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  a
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  a
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  a

In [10]:
df['A'] = df['A'].apply(str.upper)

In [12]:
df.head()

         time                                data  A
0  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
1  1473411962   Symbol: APPL Seqno: 0 Price: 1623  A
2  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
3  1473411963   Symbol: APPL Seqno: 0 Price: 1623  A
4  1473411963   Symbol: APPL Seqno: 1 Price: 1649  A

In [13]:
df['data'][0]

' Symbol: APPL Seqno: 0 Price: 1623'

In [14]:
df['data'][0].split(' ')

['', 'Symbol:', 'APPL', 'Seqno:', '0', 'Price:', '1623']

In [15]:
df['data'][0].strip().split(' ')

['Symbol:', 'APPL', 'Seqno:', '0', 'Price:', '1623']

In [16]:
l1 = df['data'][0].strip().split(' ')

In [17]:
l1[1],l1[3],l1[5]

('APPL', '0', '1623')

In [19]:
def foo(line):
    items = line.strip().split(' ')
    return Series([items[1],items[3],items[5]])

In [20]:
df_tmp = df['data'].apply(foo)

In [24]:
df_tmp = df_tmp.rename(columns={0:"Symbol",1:"Seqno",2:"Price"})

In [25]:
df_tmp.head()

  Symbol Seqno Price
0   APPL     0  1623
1   APPL     0  1623
2   APPL     0  1623
3   APPL     0  1623
4   APPL     1  1649

In [27]:
df_new = df.combine_first(df_tmp)

In [28]:
df_new.head()

   A   Price  Seqno Symbol                                data        time
0  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
1  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411962
2  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
3  A  1623.0    0.0   APPL   Symbol: APPL Seqno: 0 Price: 1623  1473411963
4  A  1649.0    1.0   APPL   Symbol: APPL Seqno: 1 Price: 1649  1473411963

In [29]:
del df_new['data']

In [31]:
del df_new['A']
df_new.head()

    Price  Seqno Symbol        time
0  1623.0    0.0   APPL  1473411962
1  1623.0    0.0   APPL  1473411962
2  1623.0    0.0   APPL  1473411963
3  1623.0    0.0   APPL  1473411963
4  1649.0    1.0   APPL  1473411963

In [32]:
df_new.to_csv('/Users/LING/demo_duplicate.csv')